In [2]:
import pandas as pd
import numpy as np

In [5]:
my_list= [1,2,3,4]
arr1 = np.array([1,2,3,4])
d = {'a':1, 'b':'2', 'c':'3'}

In [10]:
pd.Series(data= my_list, index=['a', 'b', 'c', 'd'])

a    1
b    2
c    3
d    4
dtype: int64

In [12]:
pd.Series(d)

a    1
b    2
c    3
dtype: object

In [13]:
ser1 = pd.Series(data=[1,2,3,4], index=['India', 'USA', 'UK', 'Japan'])

In [14]:
ser1

India    1
USA      2
UK       3
Japan    4
dtype: int64

In [15]:
ser2 = pd.Series(data=[1,2,3,4], index=['India', 'USA', 'USSR', 'Japan'])

In [16]:
ser2

India    1
USA      2
USSR     3
Japan    4
dtype: int64

In [17]:
ser1 + ser2

India    2.0
Japan    8.0
UK       NaN
USA      4.0
USSR     NaN
dtype: float64

In [21]:
ser1.values

array([1, 2, 3, 4], dtype=int64)

In [58]:
df = pd.DataFrame(data= np.random.randn(5,4), index=['A', 'B', 'C', 'D', 'E'], columns=['W', 'X', 'Y', 'Z'])

In [59]:
df

          W         X         Y         Z
A -0.885258  0.823221  1.367854 -0.059818
B -2.005025  0.182300 -1.396532 -0.648502
C -0.799814 -0.002104  0.973511  0.080954
D  1.429569 -1.217531 -0.264749  0.189580
E  1.115029  0.235842  0.537480 -0.385552

In [31]:
df.W

A    2.010639
B   -1.078237
C   -0.535335
D   -1.444964
E   -0.679687
Name: W, dtype: float64

In [34]:
df[['X', 'Y']]

          X         Y
A  0.910898  0.954624
B -0.787207 -1.764713
C  0.197661  1.542258
D -0.782281  1.552519
E  1.407250 -0.319407

In [41]:
df

          W         X         Y         Z
A  2.010639  0.910898  0.954624  1.081963
B -1.078237 -0.787207 -1.764713  0.331008
C -0.535335  0.197661  1.542258  1.087329
D -1.444964 -0.782281  1.552519  0.656577
E -0.679687  1.407250 -0.319407  1.786042

In [45]:
df.loc[['A', 'B']]

          W         X         Y         Z
A  2.010639  0.910898  0.954624  1.081963
B -1.078237 -0.787207 -1.764713  0.331008

In [56]:
df

          W         X         Y         Z
A  2.010639  0.910898  0.954624  1.081963
B -1.078237 -0.787207 -1.764713  0.331008
C -0.535335  0.197661  1.542258  1.087329
D -1.444964 -0.782281  1.552519  0.656577
E -0.679687  1.407250 -0.319407  1.786042

In [48]:
df.iloc[2]

W   -0.535335
X    0.197661
Y    1.542258
Z    1.087329
Name: C, dtype: float64

In [55]:
df.loc[['A', 'B'], ['X', 'Y']]

          X         Y
A  0.910898  0.954624
B -0.787207 -1.764713

In [60]:
df

          W         X         Y         Z
A -0.885258  0.823221  1.367854 -0.059818
B -2.005025  0.182300 -1.396532 -0.648502
C -0.799814 -0.002104  0.973511  0.080954
D  1.429569 -1.217531 -0.264749  0.189580
E  1.115029  0.235842  0.537480 -0.385552

In [82]:
df['States'] = ['CA', 'NY', 'NJ', 'TX', 'OR']

In [67]:
df['P'] = df['W'] + df['X']

In [68]:
df

          W         X         Y         Z States         P
A -0.885258  0.823221  1.367854 -0.059818     CA -0.062037
B -2.005025  0.182300 -1.396532 -0.648502     NY -1.822725
C -0.799814 -0.002104  0.973511  0.080954     NJ -0.801918
D  1.429569 -1.217531 -0.264749  0.189580     TX  0.212038
E  1.115029  0.235842  0.537480 -0.385552     OR  1.350871

In [70]:
df.shape

(5, 6)

In [75]:
df.drop(['States', 'P'], axis=1, inplace=True)

In [83]:
df

          W         X         Y         Z States
A -0.885258  0.823221  1.367854 -0.059818     CA
B -2.005025  0.182300 -1.396532 -0.648502     NY
C -0.799814 -0.002104  0.973511  0.080954     NJ
D  1.429569 -1.217531 -0.264749  0.189580     TX
E  1.115029  0.235842  0.537480 -0.385552     OR

In [85]:
df.reset_index()

  index         W         X         Y         Z States
0     A -0.885258  0.823221  1.367854 -0.059818     CA
1     B -2.005025  0.182300 -1.396532 -0.648502     NY
2     C -0.799814 -0.002104  0.973511  0.080954     NJ
3     D  1.429569 -1.217531 -0.264749  0.189580     TX
4     E  1.115029  0.235842  0.537480 -0.385552     OR

In [86]:
df

          W         X         Y         Z States
A -0.885258  0.823221  1.367854 -0.059818     CA
B -2.005025  0.182300 -1.396532 -0.648502     NY
C -0.799814 -0.002104  0.973511  0.080954     NJ
D  1.429569 -1.217531 -0.264749  0.189580     TX
E  1.115029  0.235842  0.537480 -0.385552     OR

In [90]:
df.set_index('States')

               W         X         Y         Z
States
CA     -0.885258  0.823221  1.367854 -0.059818
NY     -2.005025  0.182300 -1.396532 -0.648502
NJ     -0.799814 -0.002104  0.973511  0.080954
TX      1.429569 -1.217531 -0.264749  0.189580
OR      1.115029  0.235842  0.537480 -0.385552

In [92]:
df.drop('States', axis=1, inplace=True)

In [93]:
df

          W         X         Y         Z
A -0.885258  0.823221  1.367854 -0.059818
B -2.005025  0.182300 -1.396532 -0.648502
C -0.799814 -0.002104  0.973511  0.080954
D  1.429569 -1.217531 -0.264749  0.189580
E  1.115029  0.235842  0.537480 -0.385552

In [95]:
df

          W         X         Y         Z
A -0.885258  0.823221  1.367854 -0.059818
B -2.005025  0.182300 -1.396532 -0.648502
C -0.799814 -0.002104  0.973511  0.080954
D  1.429569 -1.217531 -0.264749  0.189580
E  1.115029  0.235842  0.537480 -0.385552

In [103]:
df

          W         X         Y         Z
A -0.885258  0.823221  1.367854 -0.059818
B -2.005025  0.182300 -1.396532 -0.648502
C -0.799814 -0.002104  0.973511  0.080954
D  1.429569 -1.217531 -0.264749  0.189580
E  1.115029  0.235842  0.537480 -0.385552

In [108]:
df

          W         X         Y         Z
A -0.885258  0.823221  1.367854 -0.059818
B -2.005025  0.182300 -1.396532 -0.648502
C -0.799814 -0.002104  0.973511  0.080954
D  1.429569 -1.217531 -0.264749  0.189580
E  1.115029  0.235842  0.537480 -0.385552

In [107]:
df[df['Z'] > 0]

          W         X         Y         Z
C -0.799814 -0.002104  0.973511  0.080954
D  1.429569 -1.217531 -0.264749  0.189580

In [119]:
df[(df['Z'] > 0) & (df['Y']>0)]

          W         X         Y         Z
C -0.799814 -0.002104  0.973511  0.080954

In [112]:
df['Z'] > 0

A    False
B    False
C     True
D     True
E    False
Name: Z, dtype: bool

In [113]:
df['Y'] > 0

A     True
B    False
C     True
D    False
E     True
Name: Y, dtype: bool

In [111]:
True and False

False

In [120]:
df

          W         X         Y         Z
A -0.885258  0.823221  1.367854 -0.059818
B -2.005025  0.182300 -1.396532 -0.648502
C -0.799814 -0.002104  0.973511  0.080954
D  1.429569 -1.217531 -0.264749  0.189580
E  1.115029  0.235842  0.537480 -0.385552

In [122]:
df1 = pd.DataFrame({'a': [1, np.nan, np.nan], 'b': [np.nan, 2,3], 'c':[4,5,6]})

In [133]:
df1

     a    b  c
0  1.0  NaN  4
1  NaN  2.0  5
2  NaN  3.0  6

In [136]:
df

          W         X         Y         Z
A -0.885258  0.823221  1.367854 -0.059818
B -2.005025  0.182300 -1.396532 -0.648502
C -0.799814 -0.002104  0.973511  0.080954
D  1.429569 -1.217531 -0.264749  0.189580
E  1.115029  0.235842  0.537480 -0.385552

In [137]:
df1

     a    b  c
0  1.0  NaN  4
1  NaN  2.0  5
2  NaN  3.0  6

In [140]:
df1.dropna(axis=0)

Empty DataFrame
Columns: [a, b, c]
Index: []

In [139]:
df1.dropna(axis=1)

   c
0  4
1  5
2  6

In [141]:
df1

     a    b  c
0  1.0  NaN  4
1  NaN  2.0  5
2  NaN  3.0  6

In [146]:
df1[['c', 'b']].dropna()

   c    b
1  5  2.0
2  6  3.0

In [149]:
df1.fillna(0)

     a    b  c
0  1.0  0.0  4
1  0.0  2.0  5
2  0.0  3.0  6

In [4]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [2]:
import pandas as pd
import numpy as np

In [5]:
df = pd.DataFrame(data)

In [6]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [28]:
df['revenue'] = list(range(1000,1006))

In [29]:
df

  Company   Person  Sales  revenue
0    GOOG      Sam    200     1000
1    GOOG  Charlie    120     1001
2    MSFT      Amy    340     1002
3    MSFT  Vanessa    124     1003
4      FB     Carl    243     1004
5      FB    Sarah    350     1005

In [30]:
df.groupby('Company').mean()

         Sales  revenue
Company
FB       296.5   1004.5
GOOG     160.0   1000.5
MSFT     232.0   1002.5

In [34]:
df.groupby('Company')[['Sales', 'revenue']].mean()

         Sales  revenue
Company
FB       296.5   1004.5
GOOG     160.0   1000.5
MSFT     232.0   1002.5

In [35]:
df

  Company   Person  Sales  revenue
0    GOOG      Sam    200     1000
1    GOOG  Charlie    120     1001
2    MSFT      Amy    340     1002
3    MSFT  Vanessa    124     1003
4      FB     Carl    243     1004
5      FB    Sarah    350     1005

In [38]:
df.groupby(['Company', 'Person']).mean()

                 Sales  revenue
Company Person
FB      Carl       243     1004
        Sarah      350     1005
GOOG    Charlie    120     1001
        Sam        200     1000
MSFT    Amy        340     1002
        Vanessa    124     1003

In [39]:
df.groupby('Company').mean()

         Sales  revenue
Company
FB       296.5   1004.5
GOOG     160.0   1000.5
MSFT     232.0   1002.5

In [42]:
df.groupby('Company').mean().reset_index()

  Company  Sales  revenue
0      FB  296.5   1004.5
1    GOOG  160.0   1000.5
2    MSFT  232.0   1002.5

In [54]:
df.groupby(['Company', 'Person']).mean()

                 Sales  revenue
Company Person
FB      Carl       243     1004
        Sarah      350     1005
GOOG    Charlie    120     1001
        Sam        200     1000
MSFT    Amy        340     1002
        Vanessa    124     1003

In [50]:
df.groupby('Company')['Sales'].mean()

Company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: Sales, dtype: float64

In [53]:
df.groupby('Company')['Sales'].agg(['mean', 'sum', 'count'])

          mean  sum  count
Company
FB       296.5  593      2
GOOG     160.0  320      2
MSFT     232.0  464      2

In [22]:
df.count()

Company    6
Person     6
Sales      6
dtype: int64

In [48]:
df.groupby('Company').describe()

        Sales                                                         revenue  \
        count   mean         std    min     25%    50%     75%    max   count
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0     2.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0     2.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0     2.0


           mean       std     min      25%     50%      75%     max
Company
FB       1004.5  0.707107  1004.0  1004.25  1004.5  1004.75  1005.0
GOOG     1000.5  0.707107  1000.0  1000.25  1000.5  1000.75  1001.0
MSFT     1002.5  0.707107  1002.0  1002.25  1002.5  1002.75  1003.0

In [49]:
df.groupby('Company').describe().transpose()

Company                 FB         GOOG         MSFT
Sales   count     2.000000     2.000000     2.000000
        mean    296.500000   160.000000   232.000000
        std      75.660426    56.568542   152.735065
        min     243.000000   120.000000   124.000000
        25%     269.750000   140.000000   178.000000
        50%     296.500000   160.000000   232.000000
        75%     323.250000   180.000000   286.000000
        max     350.000000   200.000000   340.000000
revenue count     2.000000     2.000000     2.000000
        mean   1004.500000  1000.500000  1002.500000
        std       0.707107     0.707107     0.707107
        min    1004.000000  1000.000000  1002.000000
        25%    1004.250000  1000.250000  1002.250000
        50%    1004.500000  1000.500000  1002.500000
        75%    1004.750000  1000.750000  1002.750000
        max    1005.000000  1001.000000  1003.000000